# Создать телефонный справочник с возможностью импорта и экспорта данных в формате .txt. 
# Фамилия, имя, отчество, номер телефона - данные, которые должны находиться в файле

# 1 Программа должна выводить данные. 
# 2. Программа должна сохранять данные в текстовом файле. 
# 3.Пользователь может ввести одну из характеристик для поиска определнной записи (Имя или фамилию). 
# 4. Использование функций. Программа не должна быть линейной.

# import ui

from ui import interface

if __name__ == "__main__":
    interface()

