# Задача 2: 
# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

print('введите трехзначное число ')
a = input()
b = int(a[0]) + int(a[1]) + int(a[2])
print(f"{a[0]} + {a[1]} + {a[2]} = {b}")